outerSpace/app/views/systems/index.html.erb

SELECT "ships".* FROM "ships" WHERE "ships"."system_id" = $1  [["system_id", 1]]
---
  <br>
     <% system.ships.each do |ship| %>