outerSpace/app/views/systems/show.html.erb

SELECT "ships".* FROM "ships" WHERE "ships"."system_id" = $1  [["system_id", 1]]
---
<h1><%= @system.name%></h1>
 <% @system.ships.each do |ship| %>