outerSpace/app/controllers/ships_controller.rb

  def create
    ship = Ship.new(ship_params)
    if ship.save
---
INSERT INTO "ships" ("name", "velocity", "created_at", "updated_at", "system_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "we"], ["velocity", 2], ["created_at", "2019-04-30 19:22:16.475895"], ["updated_at", "2019-04-30 19:22:16.475895"], ["system_id", 3]]

  def show
    @ship = Ship.find(params[:id])
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @ship = Ship.find(params[:id])
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @ship = Ship.find(params[:id])
   if @ship.update(ship_params)
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "ships" SET "system_id" = $1, "updated_at" = $2 WHERE "ships"."id" = $3  [["system_id", 5], ["updated_at", "2019-04-30 19:55:29.603156"], ["id", 1]]