outerSpace/app/controllers/systems_controller.rb

  def create
  @system = System.new(system_params)
  if @system.save
---
INSERT INTO "systems" ("name", "radius", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fsd"], ["radius", 645], ["created_at", "2019-04-30 18:19:52.240777"], ["updated_at", "2019-04-30 18:19:52.240777"]]

  def index
    @systems = System.all
---
SELECT "systems".* FROM "systems"

  def show
    @system = System.find(params[:id])
---
SELECT  "systems".* FROM "systems" WHERE "systems"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]