outerSpace/app/views/ships/edit.html.erb

  <select  name="ship[system_id]">
        <% System.all.each do |system| %>
---
SELECT "systems".* FROM "systems"